In [1]:
import pandas as pd
income15 = pd.read_csv('Resources/est15all.csv')
income16 = pd.read_csv('Resources/est16all.csv')
income17 = pd.read_csv('Resources/est17all.csv')
income18 = pd.read_csv('Resources/est18all.csv')
income19 = pd.read_csv('Resources/est19all.csv')

Median Household Income 2015

In [2]:
list(income15)

['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 22',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30']

In [3]:
income15.drop(['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30'], 1, inplace=True)
income15.head()

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/3648254648.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  income15.drop(['Table with column headers in rows 3 and 4',

    Unnamed: 2     Unnamed: 3              Unnamed: 22
0          NaN            NaN                      NaN
1          NaN            NaN  Median Household Income
2  Postal Code           Name  Median Household Income
3           US  United States                   55,775
4           AL        Alabama                   44,833

In [4]:
list(income15)

['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 22']

In [5]:
income15 = income15.rename(columns={'Unnamed: 2':'Abbrv', 'Unnamed: 3':'County', 'Unnamed: 22':'Median Household Income 2015'})
print(income15.shape)
income15.head()

(3197, 3)

         Abbrv         County Median Household Income 2015
0          NaN            NaN                          NaN
1          NaN            NaN      Median Household Income
2  Postal Code           Name      Median Household Income
3           US  United States                       55,775
4           AL        Alabama                       44,833

In [6]:
income15 = income15.drop([0,1,2], axis=0)
income15 = income15.reset_index(drop=True)
print(income15.shape)
income15.head()

(3194, 3)

  Abbrv          County Median Household Income 2015
0    US   United States                       55,775
1    AL         Alabama                       44,833
2    AL  Autauga County                       56,580
3    AL  Baldwin County                       52,387
4    AL  Barbour County                       31,433

In [7]:
income15['County_State'] = income15['County'].astype(str) +", "+ income15['Abbrv']
print(income15.shape)
income15.head()

(3194, 4)

  Abbrv          County Median Household Income 2015        County_State
0    US   United States                       55,775   United States, US
1    AL         Alabama                       44,833         Alabama, AL
2    AL  Autauga County                       56,580  Autauga County, AL
3    AL  Baldwin County                       52,387  Baldwin County, AL
4    AL  Barbour County                       31,433  Barbour County, AL

In [8]:
county_state = income15['County_State']
print(county_state.shape)
county_state.head()

(3194,)

0     United States, US
1           Alabama, AL
2    Autauga County, AL
3    Baldwin County, AL
4    Barbour County, AL
Name: County_State, dtype: object

Median Household Income 2016

In [9]:
list(income16)

['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 22',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30']

In [10]:
income16.drop(['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30'], 1, inplace=True)
income16.head()

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/2669479580.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  income16.drop(['Table with column headers in rows 3 and 4',

    Unnamed: 2     Unnamed: 3              Unnamed: 22
0          NaN            NaN                      NaN
1          NaN            NaN  Median Household Income
2  Postal Code           Name  Median Household Income
3           US  United States                   57,617
4           AL        Alabama                   46,309

In [11]:
list(income16)

['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 22']

In [12]:
income16 = income16.rename(columns={'Unnamed: 2':'Abbrv', 'Unnamed: 3':'County', 'Unnamed: 22':'Median Household Income 2016'})
print(income16.shape)
income16.head()

(3197, 3)

         Abbrv         County Median Household Income 2016
0          NaN            NaN                          NaN
1          NaN            NaN      Median Household Income
2  Postal Code           Name      Median Household Income
3           US  United States                       57,617
4           AL        Alabama                       46,309

In [13]:
income16 = income16.drop([0,1,2], axis=0)
income16 = income16.reset_index(drop=True)
print(income16.shape)
income16.head()

(3194, 3)

  Abbrv          County Median Household Income 2016
0    US   United States                       57,617
1    AL         Alabama                       46,309
2    AL  Autauga County                       54,487
3    AL  Baldwin County                       56,460
4    AL  Barbour County                       32,884

In [14]:
income16['County_State'] = income16['County'].astype(str) +", "+ income16['Abbrv']
print(income16.shape)
income16.head()

(3194, 4)

  Abbrv          County Median Household Income 2016        County_State
0    US   United States                       57,617   United States, US
1    AL         Alabama                       46,309         Alabama, AL
2    AL  Autauga County                       54,487  Autauga County, AL
3    AL  Baldwin County                       56,460  Baldwin County, AL
4    AL  Barbour County                       32,884  Barbour County, AL

Median Household Income 2017

In [15]:
list(income17)

['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 22',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30']

In [16]:
income17.drop(['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30'], 1, inplace=True)
income17.head()

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/2847760823.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  income17.drop(['Table with column headers in rows 3 and 4',

    Unnamed: 2     Unnamed: 3              Unnamed: 22
0          NaN            NaN                      NaN
1          NaN            NaN  Median Household Income
2  Postal Code           Name  Median Household Income
3           US  United States                   60,336
4           AL        Alabama                   48,193

In [17]:
list(income17)

['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 22']

In [18]:
income17 = income17.rename(columns={'Unnamed: 2':'Abbrv', 'Unnamed: 3':'County', 'Unnamed: 22':'Median Household Income 2017'})
print(income17.shape)
income17.head()

(3197, 3)

         Abbrv         County Median Household Income 2017
0          NaN            NaN                          NaN
1          NaN            NaN      Median Household Income
2  Postal Code           Name      Median Household Income
3           US  United States                       60,336
4           AL        Alabama                       48,193

In [19]:
income17 = income17.drop([0,1,2], axis=0)
income17 = income17.reset_index(drop=True)
print(income17.shape)
income17.head()

(3194, 3)

  Abbrv          County Median Household Income 2017
0    US   United States                       60,336
1    AL         Alabama                       48,193
2    AL  Autauga County                       58,343
3    AL  Baldwin County                       56,607
4    AL  Barbour County                       32,490

In [20]:
income17['County_State'] = income17['County'].astype(str) +", "+ income17['Abbrv']
print(income17.shape)
income17.head()

(3194, 4)

  Abbrv          County Median Household Income 2017        County_State
0    US   United States                       60,336   United States, US
1    AL         Alabama                       48,193         Alabama, AL
2    AL  Autauga County                       58,343  Autauga County, AL
3    AL  Baldwin County                       56,607  Baldwin County, AL
4    AL  Barbour County                       32,490  Barbour County, AL

Median Household Income 2018

In [21]:
list(income18)

['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 22',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30']

In [22]:
income18.drop(['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30'], 1, inplace=True)
income18.head()

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/1118570410.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  income18.drop(['Table with column headers in rows 3 and 4',

    Unnamed: 2     Unnamed: 3              Unnamed: 22
0          NaN            NaN                      NaN
1          NaN            NaN  Median Household Income
2  Postal Code           Name  Median Household Income
3           US  United States                   61,937
4           AL        Alabama                   49,881

In [23]:
list(income18)

['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 22']

In [24]:
income18 = income18.rename(columns={'Unnamed: 2':'Abbrv', 'Unnamed: 3':'County', 'Unnamed: 22':'Median Household Income 2018'})
print(income18.shape)
income18.head()

(3197, 3)

         Abbrv         County Median Household Income 2018
0          NaN            NaN                          NaN
1          NaN            NaN      Median Household Income
2  Postal Code           Name      Median Household Income
3           US  United States                       61,937
4           AL        Alabama                       49,881

In [25]:
income18 = income18.drop([0,1,2], axis=0)
income18 = income18.reset_index(drop=True)
print(income18.shape)
income18.head()

(3194, 3)

  Abbrv          County Median Household Income 2018
0    US   United States                       61,937
1    AL         Alabama                       49,881
2    AL  Autauga County                       59,338
3    AL  Baldwin County                       57,588
4    AL  Barbour County                       34,382

In [26]:
income18['County_State'] = income18['County'].astype(str) +", "+ income18['Abbrv']
print(income18.shape)
income18.head()

(3194, 4)

  Abbrv          County Median Household Income 2018        County_State
0    US   United States                       61,937   United States, US
1    AL         Alabama                       49,881         Alabama, AL
2    AL  Autauga County                       59,338  Autauga County, AL
3    AL  Baldwin County                       57,588  Baldwin County, AL
4    AL  Barbour County                       34,382  Barbour County, AL

Median Household Income 2019

In [27]:
list(income19)

['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 22',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30']

In [28]:
income19.drop(['Table with column headers in rows 3 and 4',
 'Unnamed: 1',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 14',
 'Unnamed: 15',
 'Unnamed: 16',
 'Unnamed: 17',
 'Unnamed: 18',
 'Unnamed: 19',
 'Unnamed: 20',
 'Unnamed: 21',
 'Unnamed: 23',
 'Unnamed: 24',
 'Unnamed: 25',
 'Unnamed: 26',
 'Unnamed: 27',
 'Unnamed: 28',
 'Unnamed: 29',
 'Unnamed: 30'], 1, inplace=True)
income19.head()

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/3875315755.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  income19.drop(['Table with column headers in rows 3 and 4',

    Unnamed: 2     Unnamed: 3              Unnamed: 22
0          NaN            NaN                      NaN
1          NaN            NaN  Median Household Income
2  Postal Code           Name  Median Household Income
3           US  United States                   65,712
4           AL        Alabama                   51,771

In [29]:
list(income19)

['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 22']

In [30]:
income19 = income19.rename(columns={'Unnamed: 2':'Abbrv', 'Unnamed: 3':'County', 'Unnamed: 22':'Median Household Income 2019'})
print(income19.shape)
income19.head()

(3197, 3)

         Abbrv         County Median Household Income 2019
0          NaN            NaN                          NaN
1          NaN            NaN      Median Household Income
2  Postal Code           Name      Median Household Income
3           US  United States                       65,712
4           AL        Alabama                       51,771

In [31]:
income19 = income19.drop([0,1,2], axis=0)
income19 = income19.reset_index(drop=True)
print(income19.shape)
income19.head()

(3194, 3)

  Abbrv          County Median Household Income 2019
0    US   United States                       65,712
1    AL         Alabama                       51,771
2    AL  Autauga County                       58,233
3    AL  Baldwin County                       59,871
4    AL  Barbour County                       35,972

In [32]:
income19['County_State'] = income19['County'].astype(str) +", "+ income19['Abbrv']
print(income19.shape)
income19.head()

(3194, 4)

  Abbrv          County Median Household Income 2019        County_State
0    US   United States                       65,712   United States, US
1    AL         Alabama                       51,771         Alabama, AL
2    AL  Autauga County                       58,233  Autauga County, AL
3    AL  Baldwin County                       59,871  Baldwin County, AL
4    AL  Barbour County                       35,972  Barbour County, AL

In [33]:
median_income_15_19 = pd.merge(county_state, income15)
print(median_income_15_19.shape)
median_income_15_19.head()

(3196, 4)

         County_State Abbrv          County Median Household Income 2015
0   United States, US    US   United States                       55,775
1         Alabama, AL    AL         Alabama                       44,833
2  Autauga County, AL    AL  Autauga County                       56,580
3  Baldwin County, AL    AL  Baldwin County                       52,387
4  Barbour County, AL    AL  Barbour County                       31,433

In [34]:
median_income_15_19 = pd.merge(median_income_15_19, income16)
print(median_income_15_19.shape)
median_income_15_19.head()

(3200, 5)

,County_State,Abbrv,County,Median Household Income 2015,Median Household Income 2016
0,"United States, US",US,United States,"55,775","57,617"
1,"Alabama, AL",AL,Alabama,"44,833","46,309"
2,"Autauga County, AL",AL,Autauga County,"56,580","54,487"
3,"Baldwin County, AL",AL,Baldwin County,"52,387","56,460"
4,"Barbour County, AL",AL,Barbour County,"31,433","32,884"

In [35]:
median_income_15_19 = pd.merge(median_income_15_19, income17)
print(median_income_15_19.shape)
median_income_15_19.head()

(3208, 6)

,County_State,Abbrv,County,Median Household Income 2015,Median Household Income 2016,Median Household Income 2017
0,"United States, US",US,United States,"55,775","57,617","60,336"
1,"Alabama, AL",AL,Alabama,"44,833","46,309","48,193"
2,"Autauga County, AL",AL,Autauga County,"56,580","54,487","58,343"
3,"Baldwin County, AL",AL,Baldwin County,"52,387","56,460","56,607"
4,"Barbour County, AL",AL,Barbour County,"31,433","32,884","32,490"

In [36]:
median_income_15_19 = pd.merge(median_income_15_19, income18)
print(median_income_15_19.shape)
median_income_15_19.head()

(3224, 7)

,County_State,Abbrv,County,Median Household Income 2015,Median Household Income 2016,Median Household Income 2017,Median Household Income 2018
0,"United States, US",US,United States,"55,775","57,617","60,336","61,937"
1,"Alabama, AL",AL,Alabama,"44,833","46,309","48,193","49,881"
2,"Autauga County, AL",AL,Autauga County,"56,580","54,487","58,343","59,338"
3,"Baldwin County, AL",AL,Baldwin County,"52,387","56,460","56,607","57,588"
4,"Barbour County, AL",AL,Barbour County,"31,433","32,884","32,490","34,382"

In [37]:
median_income_15_19 = pd.merge(median_income_15_19, income19)
print(median_income_15_19.shape)
median_income_15_19.head()

(3256, 8)

,County_State,Abbrv,County,Median Household Income 2015,Median Household Income 2016,Median Household Income 2017,Median Household Income 2018,Median Household Income 2019
0,"United States, US",US,United States,"55,775","57,617","60,336","61,937","65,712"
1,"Alabama, AL",AL,Alabama,"44,833","46,309","48,193","49,881","51,771"
2,"Autauga County, AL",AL,Autauga County,"56,580","54,487","58,343","59,338","58,233"
3,"Baldwin County, AL",AL,Baldwin County,"52,387","56,460","56,607","57,588","59,871"
4,"Barbour County, AL",AL,Barbour County,"31,433","32,884","32,490","34,382","35,972"

In [38]:
statesonly = ["Alabama", "Alaska", "Arizona", "Arkansas", "California",
                       "Colorado", "Connecticut", "Delaware", "Florida", "Georgia", "Hawaii", "Idaho", "Illinois", "Indiana",
                       "Iowa", "Kansas", "Kentucky", "Louisiana", "Maine", "Maryland", "Massachusetts", "Michigan", "Minnesota",
                       "Mississippi", "Missouri", "Montana", "Nebraska", "Nevada", "New Hampshire", "New Jersey", "New Mexico",
                       "New York", "North Carolina", "North Dakota", "Ohio", "Oklahoma" ,"Oregon", "Pennsylvania", "Rhode Island",
                       "South Carolina", "South Dakota", "Tennessee", "Texas", "Utah", "Vermont", "Virginia", "Washington",
                       "West Virginia", "Wisconsin", "Wyoming", "United States"]
median_income_15_19 = median_income_15_19[median_income_15_19.County.isin(statesonly) == False]

In [39]:
median_income_15_19.drop(['County'], 1, inplace=True)
print(median_income_15_19.shape)
median_income_15_19.head()

(3205, 7)

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/1591957269.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  median_income_15_19.drop(['County'], 1, inplace=True)

,County_State,Abbrv,Median Household Income 2015,Median Household Income 2016,Median Household Income 2017,Median Household Income 2018,Median Household Income 2019
2,"Autauga County, AL",AL,"56,580","54,487","58,343","59,338","58,233"
3,"Baldwin County, AL",AL,"52,387","56,460","56,607","57,588","59,871"
4,"Barbour County, AL",AL,"31,433","32,884","32,490","34,382","35,972"
5,"Bibb County, AL",AL,"40,767","43,079","45,795","46,064","47,918"
6,"Blount County, AL",AL,"50,487","47,213","48,253","50,412","52,902"

In [40]:
median_income_15_19.dtypes

County_State                    object
Abbrv                           object
Median Household Income 2015    object
Median Household Income 2016    object
Median Household Income 2017    object
Median Household Income 2018    object
Median Household Income 2019    object
dtype: object

In [41]:
median_income_15_19['Median Household Income 2015'] = pd.to_numeric(median_income_15_19['Median Household Income 2015'].str.replace(r'[,.%]',''))

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/175277883.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  median_income_15_19['Median Household Income 2015'] = pd.to_numeric(median_income_15_19['Median Household Income 2015'].str.replace(r'[,.%]',''))

In [42]:
median_income_15_19['Median Household Income 2016'] = pd.to_numeric(median_income_15_19['Median Household Income 2016'].str.replace(r'[,.%]',''))

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/1688586544.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  median_income_15_19['Median Household Income 2016'] = pd.to_numeric(median_income_15_19['Median Household Income 2016'].str.replace(r'[,.%]',''))

In [43]:
median_income_15_19['Median Household Income 2017'] = pd.to_numeric(median_income_15_19['Median Household Income 2017'].str.replace(r'[,.%]',''))

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/3877982973.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  median_income_15_19['Median Household Income 2017'] = pd.to_numeric(median_income_15_19['Median Household Income 2017'].str.replace(r'[,.%]',''))

In [44]:
median_income_15_19['Median Household Income 2018'] = pd.to_numeric(median_income_15_19['Median Household Income 2018'].str.replace(r'[,.%]',''))

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/2698130151.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  median_income_15_19['Median Household Income 2018'] = pd.to_numeric(median_income_15_19['Median Household Income 2018'].str.replace(r'[,.%]',''))

In [45]:
median_income_15_19['Median Household Income 2019'] = pd.to_numeric(median_income_15_19['Median Household Income 2019'].str.replace(r'[,.%]',''))

C:\Users\cookr\AppData\Local\Temp/ipykernel_23540/303071221.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  median_income_15_19['Median Household Income 2019'] = pd.to_numeric(median_income_15_19['Median Household Income 2019'].str.replace(r'[,.%]',''))

In [46]:
median_income_15_19.dtypes

County_State                     object
Abbrv                            object
Median Household Income 2015    float64
Median Household Income 2016    float64
Median Household Income 2017    float64
Median Household Income 2018    float64
Median Household Income 2019    float64
dtype: object

In [47]:
median_income_15_19['Median Household Income 2015'] = median_income_15_19['Median Household Income 2015'].astype('Int64')

In [48]:
median_income_15_19['Median Household Income 2016'] = median_income_15_19['Median Household Income 2016'].astype('Int64')

In [49]:
median_income_15_19['Median Household Income 2017'] = median_income_15_19['Median Household Income 2017'].astype('Int64')

In [50]:
median_income_15_19['Median Household Income 2018'] = median_income_15_19['Median Household Income 2018'].astype('Int64')

In [51]:
median_income_15_19['Median Household Income 2019'] = median_income_15_19['Median Household Income 2019'].astype('Int64')

In [52]:
median_income_15_19.dtypes

County_State                    object
Abbrv                           object
Median Household Income 2015     Int64
Median Household Income 2016     Int64
Median Household Income 2017     Int64
Median Household Income 2018     Int64
Median Household Income 2019     Int64
dtype: object

In [53]:
median_income_15_19 = median_income_15_19.dropna()

In [54]:
print(median_income_15_19.shape)
median_income_15_19.head()

(3204, 7)

,County_State,Abbrv,Median Household Income 2015,Median Household Income 2016,Median Household Income 2017,Median Household Income 2018,Median Household Income 2019
2,"Autauga County, AL",AL,56580,54487,58343,59338,58233
3,"Baldwin County, AL",AL,52387,56460,56607,57588,59871
4,"Barbour County, AL",AL,31433,32884,32490,34382,35972
5,"Bibb County, AL",AL,40767,43079,45795,46064,47918
6,"Blount County, AL",AL,50487,47213,48253,50412,52902

In [56]:
remove_dc_median_income_15_19 = median_income_15_19['County_State'] == 'District of Columbia, DC'
median_income_15_19 = median_income_15_19[~remove_dc_median_income_15_19]
print(median_income_15_19.shape)
median_income_15_19.head()

(3140, 7)

,County_State,Abbrv,Median Household Income 2015,Median Household Income 2016,Median Household Income 2017,Median Household Income 2018,Median Household Income 2019
2,"Autauga County, AL",AL,56580,54487,58343,59338,58233
3,"Baldwin County, AL",AL,52387,56460,56607,57588,59871
4,"Barbour County, AL",AL,31433,32884,32490,34382,35972
5,"Bibb County, AL",AL,40767,43079,45795,46064,47918
6,"Blount County, AL",AL,50487,47213,48253,50412,52902

In [57]:
median_income_15_19.to_csv('Resources/median_income_15_19_cook.csv', index=False)